# Powerful data structures for data analysis, time series, and statistics

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
labels = ['a', 'b', 'c']      #list
my_data = [10, 20, 30]
arr = np.array(my_data)       #array
d = {'a':10, 'b':20, 'c':30}  #dictionary

# Series

In [7]:
pd.Series(data= my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])  # usa is labelled index and 1 is data point and so on
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [20]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'India', 'Japan'])
ser2

USA        1
Germany    2
India      5
Japan      4
dtype: int64

In [21]:
ser1['USA']

1

In [22]:
ser3 = pd.Series(data = labels)

In [23]:
ser3[0]

'a'

In [25]:
ser1 + ser2   # didnt find a match so it put null(NaN) value, and others convert to float to retain all info possible

Germany    4.0
India      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [107]:
import numpy as np
import pandas as pd

In [108]:
from numpy.random import randn

In [109]:
np.random.seed(101)

In [110]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])  # data, index, columns are the arguments, dataframe is a bunch of series that share the same index. 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [111]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [112]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [113]:
type(df['W'])

pandas.core.series.Series

In [114]:
type(df)

pandas.core.frame.DataFrame

In [115]:
df['new'] = df['W'] + df['Y']  #adds a new column 'new'
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [116]:
df.shape

(5, 5)

In [117]:
df.drop('new', axis=1) # (rows, column):- rows have axis = 0 & column has axis = 0, by default .drop is set to axis = 0, so we need to make it 1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [118]:
df.drop('E')  # for rows, default axis = 0 is already set so no need to pass axis

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [119]:
df  # can see that new and E are not gone, this is because pandas dont want u to loose information, so we do below

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [120]:
df.drop('new', axis=1, inplace=True)  # inplace = True made the drop permanent
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [121]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [123]:
df.loc['C']  # selection row using location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [125]:
df.iloc[2]  # using index for selecting

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [127]:
df.loc['B', 'Y']  # value at row B and column Y

-0.8480769834036315

In [128]:
df.loc[['A', 'B'], ['W', 'Y']] #subset return of the dataframe

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077